<?php
return array(
	'STATUS'=>array(
		-1=>'全部',
		0=>'启用',
		1=>'停用',
	),
	'DEL_STATUS'=>array(
		-1=>'全部',
		0=>'未归档',
		1=>'已归档'
	),
	'YES_NO'=>array(
		0=>'是',
		1=>'否'
	),
	'LOGIN_STATE'	=>	array(
		1	=>	'成功',
		2	=>	'用户名不正确',
		3	=>	'密码为空',
		4	=>	'密码错误',
		5	=>	'禁止登录'
	),
	'DEVSE_TYPE'=> '设备类型',
	'RECORD_TYPE'=> '申报材料类型',
	'DATA_TYPE'=> '资料类型',
	'ENGIN_STATUS'=>'工程审核状态',
	'FACILITY_SOURCE'=>'设备来源',
	'STATION'=>'特种工作岗位',
	'INSTALL_TYPE'=>'安装类型',
	'MATERIAL_CATEGORY'=>'安拆告知审核材料类型',
	'INSTALL_STATUS'=>'安拆告知状态',
	'TASK_TYPE'=>'任务类型',
	'COMPANY_TYPE'=>'公司类型',
	'COMPANY_STATUS'=>'公司审核状态',


	'WARNING_CODE'=>array(

//		一级报警
		0 => '未安装牛腿销轴',
		1 => '顶升变幅作业报警',
		2 => '顶升四级风速报警',
		3 => '顶升起升作业报警',
		4 => '顶升回转作业报警',
		5 => '重量限制功能失效',
		6 => '力矩限制功能失效',
		7 => '幅度限制功能失效',
		8 => '高度限制功能失效',
		9 => '回转限制功能失效',
		10 => '垂直度报警',

//		报警
		11 => '幅度报警',
		12 => '高度报警',
		13 => '风速报警',
		14 => '回转报警',
		15 => '重量报警',
		16 => '力矩报警',
	)

);